artillery/stress-test.yml
config: 
  target: "https://automationexercise.com/api"

  phases: 
    - duration: 60
      arrivalRate: 5
    
    - duration: 60
      arrivalRate: 10
    
    - duration: 60
      arrivalRate: 15
          
    - duration: 60
      arrivalRate: 20
      
scenarios:
  - flow:
    - get: 
        url: "/productsList"